// study.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"
#include "string.h"
#include "stdio.h" 
#include "stdlib.h"
#define False 0
#define True 1
#define OK 1
#define Error 0
#define BYTE unsigned char
#define WORD unsigned short
#define DWORD unsigned int
#define PBYTE  char*
#define PWORD  short* 
#define PDWORD  int*
#define MZ_SIGNATURE 0x5A4D
#define PE_SIGNATURE 0x00004550
#define IMAGE_SIZEOF_SHORT_NAME 8
typedef struct _IMAGE_DOS_HEADERS{
	WORD e_magic;		//0x00
	WORD e_cblp;		//0x02
	WORD e_cp;			//0x04
	WORD e_crlc;		//0x06
	WORD e_cparhdr;		//0x08
	WORD e_minalloc;	//0x0A
	WORD e_maxalloc;	//0x0C
	WORD e_ss;			//0x0E
	WORD e_sp;			//0x10
	WORD e_csum;		//0x12
	WORD e_ip;			//0x14	
	WORD e_cs;			//0x16
	WORD e_lfarlc;		//0x18
	WORD e_ovno;		//0x1a
	WORD e_res[4];		//0x1c
	WORD e_oemid;		//0x24
	WORD e_oeminfo;		//0x26
	WORD e_res2[10];	//0x28
	DWORD e_lfanew;		//0x3C
}IMAGE_DOS_HEADERS,* PIMAGE_DOS_HEADERS;

typedef struct IMAGE_DATA_DIRECTORY{
	DWORD VirtualAddress;	//0x00
	DWORD Size;				//0x04
}IMAGE_DATA_DIRECTORY,PIMAGE_DATA_DIRECTORY;

typedef struct _IMAGE_EXPORT_DIRECTORY{
	DWORD Characteristics;		//0x00
	DWORD TimeDateStamp;		//0x04
	WORD MajorVersion;			//0x08
	WORD MinorVersion;			//0x10
	DWORD Name;					//0x0C
	DWORD Base;					//0x10
	DWORD NumberOfFunctions;	//0x14
	DWORD NumberOfNames;		//0x18
	DWORD AddressOfFunctions;	//0x1c
	DWORD AddressOfNames;		//0x20
	DWORD AddressOfNameOrdinals;//0x24

}IMAGE_EXPORT_DIRECTORY,*PIMAGE_EXPORT_DIRECTORY;

typedef struct _IMAGE_IMPORT_BY_NAME{
	WORD Hint;
	BYTE Name[1];
}IMAGE_IMPORT_BY_NAME,* PIMAGE_IMPORT_BY_NAME;

typedef struct _IMAGE_THUNK_DATA{
	union{
		PBYTE ForwarderString;
		PDWORD Function;
		DWORD Ordinal;
		DWORD AddressOfData;
	}ul;
}IMAGE_THUNK_DATA,* PIMAGE_THUNK_DATA;

typedef struct _IMAGE_IMPORT_DESCRIPTOR{
	union{
		DWORD Characteristics;
		DWORD OriginalFirstThunk;
	}u;
	DWORD TimaDataStamp;
	DWORD ForwarderChain;
	DWORD Name;
	DWORD FirstThunk;
}IMAGE_IMPORT_DESCRIPTOR,*PIMAGE_IMPORT_DESCRIPTOR;


typedef struct _IMAGE_BOUND_FOWARDER_REF{
	DWORD TimeDataStamp;
	WORD  OffsetModuleName;
	WORD  Reserved;
}IMAGE_BOUND_FORWARDER_REF,*PIMAGE_BOUND_FORWARDER_REF;

typedef struct _IMAGE_BOUND_IMPORT_DESCRIPTOR{
	DWORD TimeDataStamp;
	WORD  OffsetModuleName;
	WORD  NumberOfModuleForwarderRefs;
}IMAGE_BOUND_IMPORT_FORWARDER_REF,*PIMAGE_BOUND_IMPORT_DESCRIPTOR;

typedef struct _IMAGE_BASE_RELOCATION{
	DWORD VitualAddress;
	DWORD SizeOfBlock;
}IMAGE_BASE_RELOCATION,*PIMAGE_BASE_RELOCATION;

typedef struct _IMAGE_FILE_HEADERS{
	WORD Machine;				//0x00
	WORD NumberOfSections;		//0x02
	DWORD TimeDateStamp;		//0x04
	DWORD PointerToSymbolTable; //0x08
	DWORD NumberOfSymbols;		//0x0C
	WORD SizeOfOptionalHeaders; //0x10
	WORD Characteristics;		//0x12
}IMAGE_FILE_HEADERS,* PIMAGE_FILE_HEADERS;

typedef struct _IMAGE_OPTIONAL_HEADERS{
	WORD Magic;							//0x00		
	BYTE MajorLinkerVersion;			//0x02
	BYTE MinorLinkerVersion;			//0x03
	DWORD SizeOfCode;					//0x04
	DWORD SizeOfInitializedData;		//0x08
	DWORD SizeOfUninitializedData;		//0x0C
	DWORD AddressOfEntryPoint;			//0x10
	DWORD BaseOfCode;					//0x14
	DWORD BaseOfData;					//0x18
	DWORD ImageBase;					//0x1C
	DWORD SectionAlignment;				//0x20
	DWORD FileAlignment;				//0x24
	WORD MajorOperatingSystemVersion;	//0x28
	WORD MinorOperatingSystemVersion;	//0x2a
	WORD MajorImageVersion;				//0x2c
	WORD MinorImageVersion;				//0x2e
	WORD MajorSubsystemVersion;			//0x30
	WORD MinorSubsystemVersion;			//0x32
	DWORD Win32VersionValue;			//0x34
	DWORD SizeOfImage;					//0x38
	DWORD SizeOfHeaders;				//0x3c
	DWORD CheckSum;						//0x40
	WORD Subsystem;						//0x44
	WORD DLLCharacteristics;			//0x46
	DWORD SizeOfStackReserve;			//0x48
	DWORD SizeOfStackCommit;			//0x4c
	DWORD SizeOfHeapReserve;			//0x50
	DWORD SizeOfHeapCommit;				//0x54
	DWORD LoaderFlags;					//0x58
	DWORD NumberOfRvaAndSizes;			//0x5c
	IMAGE_DATA_DIRECTORY DataDirectory[16];	//0x60

}IMAGE_OPTIONAL_HEADERS,* PIMAGE_OPTIONAL_HEADERS;

typedef struct _IMAGE_NT_HEADERS{
	DWORD Signature;
	IMAGE_FILE_HEADERS FileHeaders;
	IMAGE_OPTIONAL_HEADERS OptionalHeaders;
}IMAGE_NT_HEADERS,* PIMAGE_NT_HEADERS;

typedef struct _IMAGE_SECTION_HEADERS{
	BYTE Name[IMAGE_SIZEOF_SHORT_NAME];
	union{
		DWORD PhysicalAddress;
		DWORD VirtualSize;
	}Misc;
	DWORD VirtualAddress;
	DWORD SizeOfRawData;
	DWORD PointerToRawData;
	DWORD PointerToRelocations;
	DWORD PointerToLinenumbers;
    WORD  NumberOfRelocations;			
    WORD  NumberOfLinenumbers;	
	DWORD Characteristics;

}IMAGE_SECTION_HEADERS,* PIMAGE_SECTION_HEADERS;

DWORD getFileSize(FILE* fp)
{//return FileSize
	
	int size;
	if(fp)
	{
		fseek(fp,0L,2);
		size=ftell(fp);
		//remeber to rewind file index pointer.
		rewind(fp);
		return size;
	}
	else
		return Error;
}
BYTE FileToFileBuffer(FILE* fp,PBYTE* buffer,DWORD* size)
{//return Buffer
	if(fp)
	{
		*size=getFileSize(fp);
